In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('./train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
df = df.astype({'Pclass':'object'})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    object
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(4), object(6)
memory usage: 83.7+ KB

In [6]:
df['Pclass'] = df['Pclass'].astype(str)

In [9]:
df['Pclass'] = pd.to_numeric(df['Pclass'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [10]:
df['Pclass'] = df['Pclass'].astype(str)

In [11]:
df.loc[0, 'Pclass'] = 'a'

In [12]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,a,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
import math

In [17]:
def age_cate(age):
    if math.isnan(age):
        return "나이미상"
    else:
        firstage = str(int(age/10))
        if firstage == '0':
            return '10대미만'
        else:
            return firstage + '0대'

In [18]:
for i in np.arange(df['Age'].shape[0]):
    #print(df.loc[i, 'Age'])
    print(age_cate(df.loc[i, 'Age']))

20대
30대
20대
30대
30대
나이미상
50대
10대미만
20대
10대
10대미만
50대
20대
30대
10대
50대
10대미만
나이미상
30대
나이미상
30대
30대
10대
20대
10대미만
30대
나이미상
10대
나이미상
나이미상
40대
나이미상
나이미상
60대
20대
40대
나이미상
20대
10대
10대
40대
20대
나이미상
10대미만
10대
나이미상
나이미상
나이미상
나이미상
10대
10대미만
20대
40대
20대
60대
나이미상
20대
20대
10대미만
10대
20대
30대
40대
10대미만
나이미상
나이미상
20대
10대
10대
20대
30대
10대
20대
20대
30대
20대
나이미상
나이미상
10대미만
30대
20대
20대
나이미상
20대
10대
30대
10대
나이미상
20대
20대
20대
20대
40대
20대
50대
나이미상
70대
20대
30대
30대
20대
나이미상
20대
30대
30대
20대
20대
나이미상
30대
나이미상
40대
10대
20대
20대
10대
20대
70대
20대
20대
10대미만
20대
나이미상
30대
30대
50대
10대
나이미상
20대
나이미상
40대
30대
20대
40대
20대
20대
20대
10대
30대
10대
20대
나이미상
20대
20대
10대
10대
10대
20대
10대미만
30대
40대
50대
20대
50대
40대
나이미상
50대
10대
30대
나이미상
나이미상
40대
40대
20대
10대
10대미만
10대미만
나이미상
40대
나이미상
20대
60대
10대미만
10대미만
20대
50대
10대
나이미상
50대
30대
30대
나이미상
나이미상
10대미만
10대미만
10대미만
나이미상
나이미상
40대
40대
30대
30대
10대
10대
10대미만
40대
50대
나이미상
40대
나이미상
20대
20대
나이미상
30대
40대
10대
10대미만
30대
20대
10대
40대
20대
30대
20대
30대
나이미상
30대
20대
40대
30대
30대
10대
20대
50대
나이미상
30대
20대
10대
20대
10대
나이미상
30대
20대
50대
10대미만
20대
나이미상
40대
10대미만
10대
30대
나이미상
나이미상
20대
20대
30대
40대
20대
20대
30대
50대
나이미상
20대
60대
30대
40대
20대
나이미상
30대
30대
50대
나이미상
10대미만
50대
40대
나이미상
30대
10대
20대
50대
30대
나이미상
20대
40대
30대
나이미상
60대
40대
나이미상
10대미만
30대
60대
20대
10대
10대
나이미상
30대
30대
20대
40대
20대
20대
10대
30대
20대
20대
나이미상
20대
10대미만
나이미상
50대
나이미상
나이미상
10대
나이미상
나이미상
10대미만
나이미상
10대
30대
30대
20대
10대
20대
20대
40대
20대
20대
50대
30대
40대
20대
20대
30대
20대
나이미상
30대
60대
30대
30대
10대
나이미상
40대
30대
10대
나이미상
나이미상
20대
40대
40대
40대
10대미만
20대
20대
20대
30대
20대
40대
나이미상
10대미만
40대
20대
나이미상
10대
20대
나이미상
20대
20대
30대
나이미상
나이미상
40대
20대
40대
30대
나이미상
30대
60대
나이미상
나이미상
20대
20대
10대
10대
20대
10대미만
나이미상
20대
20대
20대
10대
40대
10대미만
30대
30대
나이미상
10대
10대미만
30대
나이미상
10대
30대
20대
20대
20대
20대
20대
30대
40대
20대
20대
30대
20대
20대
20대
20대
30대
50대
10대미만
20대
나이미상
나이미상
나이미상
30대
나이미상
40대
나이미상
30대
10대
30대
10대
나이미상
20대
20대
20대
10대
나이미상
20대
10대
나이미상
30대
20대
나이미상
40대
10대
50대
10대
20대
20대
60대
30대
40대
20대
20대
20대
나이미상
10대미만
10대
30대
10대미만
50대
30대
나이미상
30대
40대
나이미상
20대
60대
나이미상
50대
나이미상
40대
30대
40대
40대
나이미상
30대
나이미상
50대
나이미상
10대미만
나이미상
30대
30대
20대
20대
나이미상
30대
20대
20대
10대미만
10대미만
나이미상
50대
60대
20대
나이미상
30대
50대
30대
10대미만
나이미상
20대
50대
70대
20대
나이미상
50대
나이미상
20대
20대
10대
20대
나이미상
30대
10대
10대
30대
나이미상
20대
20대
20대
나이미상
30대
50대
20대
40대
30대
나이미상
30대
30대
30대
20대
나이미상
40대
나이미상
40대
50대
나이미상
30대
20대
10대미만
나이미상
10대
나이미상
30대
10대미만
40대
30대
나이미상
20대
30대
10대미만
10대
30대
50대
60대
10대
나이미상
30대
10대미만
10대
20대
나이미상
20대
20대
60대
40대
나이미상
30대
30대
나이미상
40대
20대
나이미상
나이미상
20대
10대
20대
나이미상
30대
60대
50대
30대
나이미상
10대
10대
30대
30대
나이미상
30대
20대
30대
50대
30대
나이미상
10대
40대
60대
20대
나이미상
30대
50대
40대
나이미상
30대
30대
나이미상
40대
나이미상
40대
20대
나이미상
나이미상
40대
30대
30대
30대
20대
20대
40대
30대
나이미상
나이미상
나이미상
30대
20대
30대
20대
10대미만
20대
20대
40대
20대
20대
20대
60대
50대
20대
20대
나이미상
80대
50대
30대
나이미상
10대미만
20대
30대
30대
40대
나이미상
20대
20대
10대미만
나이미상
10대미만
40대
10대
50대
나이미상
20대
나이미상
10대
20대
나이미상
10대
20대
나이미상
30대
20대
50대
50대
40대
40대
30대
20대
30대
20대
나이미상
40대
나이미상
40대
30대
70대
30대
나이미상
10대
20대
10대
40대
30대
나이미상
20대
20대
10대
60대
20대
10대
10대
10대
10대
30대
10대미만
나이미상
20대
60대
50대
40대
나이미상
40대
40대
10대
30대
10대
20대
20대
30대
40대
40대
20대
나이미상
20대
나이미상
40대
20대
50대
10대
30대
20대
나이미상
30대
10대미만
10대
30대
50대
20대
20대
30대
나이미상
20대
20대
20대
10대
나이미상
20대
20대
20대
40대
30대
나이미상
나이미상
나이미상
30대
20대
20대
30대
70대
10대
30대
10대
30대
10대미만
10대미만
30대
20대
40대
10대미만
20대
10대
30대
30대
나이미상
40대
20대
30대
10대
50대
나이미상
30대
나이미상
30대
20대
40대
50대
나이미상
50대
10대
나이미상
10대미만
나이미상
40대
10대
10대
20대
나이미상
20대
20대
10대
10대미만
10대미만
40대
나이미상
10대
나이미상
나이미상
20대
30대
40대
30대
30대
30대
30대
30대
10대
10대미만
20대
30대
30대
10대
30대
30대
20대
30대
30대
10대미만
30대
나이미상
20대
30대
40대
10대
50대
20대
30대
20대
10대미만
나이미상
나이미상
10대미만
나이미상
60대
10대
10대미만
나이미상
20대
10대
30대
20대
나이미상
30대
나이미상
20대
10대
30대
30대
10대
40대
나이미상
30대
20대
나이미상
10대미만
70대
10대미만
10대
40대
10대
40대
50대
20대
나이미상
40대
20대
40대
나이미상
20대
40대
20대
30대
나이미상
10대미만
20대
40대
30대
40대
20대
10대
20대
10대
나이미상
50대
20대
30대
20대
20대
20대
30대
20대
10대
나이미상
20대
30대

In [19]:
df['연령대'] = df['Age'].apply(age_cate)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,연령대
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,20대
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,30대
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,20대
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,30대
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,30대

In [20]:
df[df['Age'].isna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,연령대
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,나이미상
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S,나이미상
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C,나이미상
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C,나이미상
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q,나이미상
...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C,나이미상
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S,나이미상
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S,나이미상
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S,나이미상
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,나이미상

In [22]:
def hap(x, y):
    return x + y

hap(10, 20)

30

In [31]:
def sex_cate(sex):
    if sex == 'male':
        return '남자'
    else:
        return '여자'

In [32]:
sex_cate('male')

'남자'

In [33]:
df['성별'] = df['Sex'].apply(sex_cate)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,연령대,성별
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,20대,남자
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,30대,여자
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,20대,여자
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,30대,여자
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,30대,남자

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    object
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  연령대          891 non-null    object
 13  성별           891 non-null    object
dtypes: float64(2), int64(4), object(8)
memory usage: 97.6+ KB

In [34]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,연령대,성별
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,20대,남자
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,30대,여자
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,20대,여자
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,30대,여자
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,30대,남자
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,20대,남자
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,10대,여자
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,나이미상,여자
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,20대,남자
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,30대,남자

In [39]:
def survived_pclass(p_df):
    str(p_df['Pclass']) + ':' + ('생존' if p_df['Survived'] == 1 else '사망')

In [40]:
df['Sur2'] = df.apply(survived_pclass, axis=1)

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    object
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  연령대          891 non-null    object
 13  성별           891 non-null    object
dtypes: float64(2), int64(4), object(8)
memory usage: 97.6+ KB